{
    "Source": "<a href='https://foolproofliving.com/chestnut-soup'>https://foolproofliving.com/chestnut-soup</a>",
    "Ingredients": [
        "Cooked and peeled chestnuts",
        "Olive oil or butter (preferably butter)",
        "Shallots",
        "Carrots (not too much)",
        "Celery (optional)",
        "Garlic",
        "Thyme",
        "Bay leaves",
        "Salt",
        "White or black pepper",
        "Heavy cream or crème fraiche",
        "A pinch of ground nutmeg",
        "Green onions (optional, I prefer the soup without green onions)",
        "Crisply fried oyster mushrooms, or bacon"
    ],
    "Instructions": "Get chestnuts that are already roasted/boiled and peeled, because peeling them yourself is a pain (although peeled chestnuts can be very expensive). Chop the shallots, carrots, celery, and garlic, then fry those in olive oil or butter until soft and aromatic. Then add the chestnuts, thyme, bay leaves, salt, and pepper. Boil until everything in the pot except the bay leaves are soft, then take out the bay leaves. Purée the soup with a blender, then add a small amount of cream and boil briefly, until it tastes done. You may need a good blender for this, because most immersion blenders won't get it completely smooth and creamy. Stir in a bit of nutmeg, then garnish with crème fraiche, green onions, and either crumbled bacon or crisped oyster mushrooms.<br><br>To make the bacon-like oyster mushrooms, marinate oyster mushrooms in soy sauce, smoked paprika, black pepper, salt, maple syrup, and olive oil, then cut them into strips and fry them.",
    "Serving suggestion": "Serve hot, and keep in mind that it will thicken as it cools (so err on the side of making it thinner).",
    "Notes": "This soup is supposed to be rich and creamy, with a smooth texture and a warm brown color. So blend it until it's totally smooth, and if you're worried about getting the right color, leave out the celery, or add a tiny bit of bright red paprika.<br><br>The techniques, ingredients, and garnishes for this soup can be applied to tons of other soups, such as pumpkin soup, or potato and leek soup."
}
